{
    "offset": 0,
    "number": 10,
    "available": 5789,
    "news": [
        {
            "id": 279756872,
            "title": "Serbia Cancels Arms Contracts with Russia, Turns to China",
            "text": "Serbia’s Chief of the General Staff Milan Mojsilovic said in an interview with the Vechernje Novosti tabloid news site that Belgrade was terminating several contracts for military materiel with Russia. He said that under the current conditions, it had proven impossible for Russia to fulfill them.\n\nMojsilovic said that a large proportion of Serbia’s military weapons and equipment were acquired during the Soviet-era which had previously been maintained and renewed by Russia. He suggested since the full-scale invasion of Ukraine and the imposition of sanctions on Moscow, Serbia had relied on third party nations who produced the same equipment under license for the support they needed.\n\nHe said that they had largely been able continue the necessary levels of maintenance, repair and spare parts to keep Serbia’s forces at the required state of combat readiness\n\nHe went on to say, however, that because of the imposition of Western sanctions against Russia it had proved impossible to receive modern replacements or key components for its current weapon systems. Mojsilovic said Belgrade had tried to solve the problem through “diplomatic channels,” but had been unable to make a breakthrough.\n\nAs a result, he said that Serbia had terminated some contracts and postponed others in the hope that once the war in Ukraine was over international relations would return to normal allowing the contracts to be implemented.\n\nDespite being a candidate for membership of the European Union Serbia has historically been one of Russia’s closest allies. The ongoing illegal war against Ukraine has put pressure on Belgrade to adjust its foreign policy to align itself more closely with the West. The combination of historical eastward looking links and the aspiration to join the EU have led to a complex, some might say almost schizophrenic, defense and foreign policy.\n\nSerbia has provided around $800 million worth of military aid to Ukraine channeled through third countries, a level that exceeds the contributions of some NATO members, which further highlights Belgrade’s increasingly problematic position in relation to the ongoing conflict between Russia and the West, as it looks to modernize its defense forces.\n\nLast year, Serbia chose to replace its aging fleet of Soviet-era MiG-29s with 12 Dassault Rafale multirole fighter aircraft, valued at €2.7 billion ($3 billion).\n\nA further example of Serbia’s strategic shift is exemplified by it apparently turning to China as a key arms supplier. On Jan. 2 Belgrade displayed the Chinese FK-3 anti-aircraft missile system, the export version of Beijing’s HQ-22 medium-range air defense system – which is an alternative to Russia’s S-400.\n\nThe FK-3 system consists of three launchers, each with four missiles, a radar station, and a control center. It is said to be capable of engaging airborne targets at a range of 100 kilometers (62.5 miles) at an altitude of up to 27 kilometers (17 miles). Unlike Russian air defense systems, the Chinese system has not yet been tested in real combat conditions.\n\nWhile displaying the system the commander of Serbia’s FK-3 missile battery said the system was a “milestone in air defense systems.”\n\nHe added “The FK-3 has an exceptional anti-jamming system and the capability to intercept missiles designed to destroy tracking radars. He said it was exceptionally maneuverable.”\n\nIt is thought that the system would be deployed to protect government buildings, military installations, and critical infrastructure, for which the crews operating the FK-3 had undergone comprehensive and intensive training in China according to the battery commander.",
            "summary": "Serbia’s Chief of the General Staff said Belgrade was forced to cancel several military contracts with Russia because of the impact of sanctions on Moscow’s ability to honor them.",
            "url": "https://www.kyivpost.com/post/45228",
            "image": "https://static.kyivpost.com/storage/2025/01/10/1b7099c94a928d20a85b9b69fad5447f.png?w=1200&q=90&f=jpg",
            "video": null,
            "publish_date": "2025-01-10 11:52:37",
            "author": "Kyiv Post",
            "authors": [
                "Kyiv Post"
            ],
            "language": "en",
            "source_country": "ua",
            "sentiment": 0.111
        },
        {
            "id": 279756874,
            "title": "Kremlin says Putin Ready for Talks with Trump",
            "text": "The Kremlin said Friday that President Vladimir Putin was open to talks with Donald Trump, after the incoming US president said a meeting between the pair was being set up.\n\n“The president has repeatedly stated his openness to contact with international leaders, including the US president, including Donald Trump,” Putin’s spokesman Dmitry Peskov told reporters.\n\nTrump, who will be inaugurated on January 20, has repeatedly said he can bring a swift end to the nearly three-year conflict between Russia and Ukraine, without presenting a concrete plan.\n\nOn Thursday he said a meeting with Putin was being arranged.\n\n“He wants to meet, and we’re setting it up,” Trump said at a meeting with Republican governors at his Mar-a-Lago resort in Palm Beach, Florida.\n\n“President Putin wants to meet, he’s said that even publicly, and we have to get that war over with, that’s a bloody mess,” he said.\n\nThe Kremlin welcomed Trump’s “readiness to solve problems through dialogue,” Peskov said Friday, adding Moscow had no prerequisites for staging the meeting.\n\n“No conditions are required. What is required is mutual desire and political will to solve problems through dialogue,” he told reporters in a daily briefing.\n\nTrump’s hopes for a swift end to the conflict have stoked concern in Kyiv that Ukraine could be forced to accept a peace deal on terms favorable to Moscow.\n\nWashington has delivered tens of billions of dollars in aid to Ukraine since Russia launched its full-scale military offensive in February 2022.\n\nUkrainian President Volodymyr Zelensky has said that without such support his country would have lost the conflict.\n\nHe is pushing Trump to back his “peace-through-strength” proposal, seeking NATO protections and concrete Western security guarantees as part of any settlement to end the fighting.",
            "summary": "Trump, who will be inaugurated on January 20, has repeatedly said he can bring a swift end to the nearly three-year war between Russia and Ukraine.",
            "url": "https://www.kyivpost.com/post/45223",
            "image": "https://static.kyivpost.com/storage/2025/01/10/8e814ec5eebabe4a70baf0bad493330e.jpg?w=1200&q=90&f=jpg",
            "video": null,
            "publish_date": "2025-01-10 11:13:32",
            "author": "AFP",
            "authors": [
                "AFP"
            ],
            "language": "en",
            "source_country": "ua",
            "sentiment": -0.234
        },
        {
            "id": 279774360,
            "title": "ARX, FortuneGuard, McGill and Partners Launch War Risk Insurance With Limits of Up to $50 Million",
            "text": "ARX, Ukraine’s leading insurance company and a member of the Canadian Fairfax Financial Holdings group, has launched war risk insurance for commercial real estate and investments in Ukraine. \n\nIt will provide coverage of up to $50 million per risk, creating the product in collaboration with an insurtech participant in Lloyd’s Lab FortuneGuard and a top Lloyd’s broker McGill and Partners, the company’s press release said on Thursday. \n\n“Until now, insurance has primarily covered mobile assets, such as cargo via the grain corridor, or small and micro-businesses, while medium and large enterprises and investors had limited options to protect their assets.” \n\nARX will calculate rates for insurance using AI-based analytics to assess risks, considering attack history, damage, and proximity to critical infrastructure, the company said. \n\nThe product covers risks of damage from drones, missiles, and debris from air defense systems.\n\nARX has been working in the war insurance niche over the last year and a half, gaining experience on how to handle the product. \n\n“We have also gained experience in handling claims for ‘Iron Dome’ property insurance product against war risks (recently, the first claim of Hr.14 million ($333,333) was paid – compensation for damage caused by a drone to a private enterprise),” the statement quoted First Deputy CEO and Management Board Member of ARX IC JSC Maksym Mezhebytsky. \n\nHamish Greenwood, Partner and Head of Crisis Management at McGill and Partners said that ARX products would be aimed at local businesses so that they could afford to pay for protecting their assets from war risks. \n\n“Before this product, only multinational corporations could afford such coverage, leaving local businesses virtually unprotected,” said Greenwood, as per the press release. \n\nARX is one of the leading retail insurance companies on Ukraine’s market. Its net income is estimated at Hr.287.5 million ($6.8 million) for three quarters of 2024, according to the statistics of Ukraine’s central bank, the National Bank of Ukraine. This is the third highest net income result for the same time period compared to other players on the market.\n\nThe European Bank for Reconstruction and Development (EBRD) and leading professional services firm Aon launched a bank guarantee designed to reinsurance capacity to private-sector insurers in Ukraine. The plan should cover internal domestic cargo, motor vehicle damage and railway rolling stock.\n\nThe insurance was launched as a tool for the new €110 million Ukraine Recovery and Reconstruction Guarantee Facility.\n\nWar insurance saved Ukraine’s vital shipping route for exporting grain, though global insurers should stop “blanket” exclusion of Ukraine’s market, Senior Marsh McLennan partner told Kyiv Post previously in an interview.\n\nMarsh McLennan, a global leader in risk management services, is now negotiating coverage for potential civilian flights from Ukraine once the sky is safer. \n\nUkraine is working on broader war insurance – the National Bank of Ukraine, the Ministry of Economy and the Ministry of Finance presented the draft Law of Ukraine “On the System of Military Risk Insurance” to create a solution for this issue.",
            "summary": "Another market player joined the war risk insurance niche in Ukraine – this time it’s Ukraine’s largest insurance company ARX.",
            "url": "https://www.kyivpost.com/post/45177",
            "image": "https://static.kyivpost.com/storage/2025/01/09/fc7d9758a5577408691455c5aef23624.png?w=1200&q=90&f=jpg",
            "video": null,
            "publish_date": "2025-01-10 13:21:49",
            "author": "Olena Hrazhdan",
            "authors": [
                "Olena Hrazhdan"
            ],
            "language": "en",
            "source_country": "ua",
            "sentiment": -0.395
        },
        {
            "id": 281024730,
            "title": "Україну накриє термічна аномалія і вдарять морози. Синоптик попередила про назвичну погоду і похолодання",
            "text": "TCF vendors\n\nExponential Interactive, Inc d/b/a VDX.tvCookie duration: 90 (days).Data collected and processed: IP addresses, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nRoq.ad GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdMaxim LimitedCookie duration: 30 (days).Data collected and processed: IP addresses, Probabilistic identifiers, Browsing and interaction datamoreCookie duration resets each session. View details | Privacy policy\n\nIndex Exchange Inc. Cookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nQuantcastCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nBeeswaxIO CorporationCookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSovrn, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAdikteevDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Non-precise location data, Users’ profilesmoreUses other forms of storage.View details | Privacy policy\n\nRTB House S.A.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nThe UK Trade Desk LtdCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNexxen Inc.Cookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEpsilonCookie duration: 184 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nYahoo EMEA LimitedCookie duration: 397 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nADventori SASCookie duration: 90 (days).Data collected and processed: IP addresses, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTriple Lift, Inc.Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nXandr, Inc.Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNEORY GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nNexxen Group LLCCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nNEURAL.ONECookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nADITION (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nActive Agent (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTaboola Europe LimitedCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEquativCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nAdform A/SCookie duration: 3650 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMagnite, Inc. Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRATEGAIN ADARA INCCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\n33AcrossCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSift Media, IncDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location datamoreView details | Privacy policy\n\nRakuten Marketing LLCCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLumen Research LimitedDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Privacy policy\n\nAmazon Ad ServerCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nOpenXCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nYieldlab (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRoku Advertising ServicesCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNano Interactive Group Ltd.Doesn't use cookies.Data collected and processed: Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Privacy policy\n\nSimplifi Holdings LLCCookie duration: 366 (days).Data collected and processed: IP addresses, Device identifiers, Precise location datamoreUses other forms of storage.View details | Privacy policy\n\nPubMatic, IncCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nComscore B.V.Cookie duration: 720 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nFlashtalkingCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreView details | Privacy policy\n\nPulsePoint, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nSmaato, Inc.Cookie duration: 21 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSemasio GmbHCookie duration: 366 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nCrimtan Holdings LimitedCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nGenius Sports UK LimitedCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nCriteo SACookie duration: 390 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nAdloox SADoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location datamoreUses other forms of storage.View details | Privacy policy\n\nBlis Global LimitedCookie duration: 400 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nLotame Solutions, IncCookie duration: 274 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLiveRampCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nGroupM UK LimitedCookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSonobi, IncCookie duration: 60 (days).Data collected and processed: IP addresses, Device identifiers, Non-precise location datamoreView details | Privacy policy\n\nRich Audience Technologies SLUCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nLoopMe LimitedCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDynata LLCCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAsk LocalaDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nAziraDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nDoubleVerify Inc.​Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreView details | Privacy policy\n\nBIDSWITCH GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nIPONWEB GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNextRoll, Inc.Cookie duration: 183 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nID5 Technology LtdCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTeads France SASCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nStröer SSP GmbH (SSP)Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nOS Data Solutions GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nConnectAd Demand GmbHCookie duration: 31 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nPermodo GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nPlatform161 B.V.Cookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMedia.net Advertising FZ-LLCCookie duration: 2190 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLiveIntent Inc.Cookie duration: 731 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nBasis Global Technologies, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nSeedtag Advertising S.LCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSMADEX, S.L.U.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nBombora Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profilesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nOutbrain UK LtdCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEASYmedia GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nRemerge GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location datamoreUses other forms of storage.View details | Privacy policy\n\nadvanced store GmbHCookie duration: 365 (days).Data collected and processed: Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMagnite CTV, Inc.Cookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDelta Projects ABCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\nZemanta Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nusemax advertisement (Emego GmbH)Cookie duration: 365 (days).Data collected and processed: IP addresses, Users’ profilesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nemetriq GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPublicis Media GmbHCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nM.D. Primis Technologies Ltd.Cookie duration: 25 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreView details | Storage details | Privacy policy\n\nOneTag LimitedCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nCloud Technologies S.A.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nSmartology LimitedDoesn't use cookies.Data collected and processed: IP addressesmoreUses other forms of storage.View details | Privacy policy\n\nImprove DigitalCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdobe Advertising CloudCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Authentication-derived identifiers, Privacy choicesmoreView details | Storage details | Privacy policy\n\nBannerflow ABCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nTabMo SASDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nIntegral Ad Science (incorporating ADmantX)Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location data, Privacy choicesmoreView details | Privacy policy\n\nWizalyCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nWeboramaCookie duration: 393 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nJivox CorporationCookie duration: 30 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nVistar Media EMEA BVDoesn't use cookies.Data collected and processed: Non-precise location datamoreView details | Privacy policy\n\nOn Device Research LimitedCookie duration: 30 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location datamoreView details | Storage details | Privacy policy\n\nRockabox Media LtdDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Storage details | Privacy policy\n\nExactag GmbHCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nCeltra Inc.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Precise location datamoreUses other forms of storage.View details | Storage details | Privacy policy\n\nmainADV SrlCookie duration: 30 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nGemius SACookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nThe Kantar Group LimitedCookie duration: 914 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nMGID Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNielsen Media Research Ltd.Cookie duration: 120 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nVidoomy Media SLCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Non-precise location datamoreView details | Storage details | Privacy policy\n\nSolocal SACookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPixalate, Inc.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location datamoreView details | Storage details | Privacy policy\n\nNumberlyCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAudienceProject A/SCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDemandbase, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEffiliation / EffinityCookie duration: 30 (days).Data collected and processed: Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nArrivalist Co.Cookie duration: 365 (days).Data collected and processed: IP addresses, Non-precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdtelligent Inc.Cookie duration: 93 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nSeenthis ABDoesn't use cookies.Data collected and processed: IP addresses, Device characteristicsmoreView details | Privacy policy\n\nCommanders ActCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiersmoreView details | Storage details | Privacy policy\n\ntravel audience GmbHCookie duration: 397 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profilesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nHUMANDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location datamoreView details | Privacy policy\n\nBlendee srlCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nInnovid LLCCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nPapirfly ASDoesn't use cookies.Data collected and processed: Device characteristicsmoreView details | Privacy policy\n\nNeustar, Inc., a TransUnion companyCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAdmixer EU GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nVerve Group Europe GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOtto (GmbH & Co KG)Cookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nAdobe Audience Manager, Adobe Experience PlatformCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nLocalsensor B.V.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOnline SolutionCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nOnfocus (Adagio)Cookie duration: 60 (days).Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRelay42 Netherlands B.V.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreView details | Privacy policy\n\nGP One GmbHCookie duration: Uses session cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nLiftoff Monetize and Vungle ExchangeDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nThe MediaGrid Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nReppublika Research & Analytics Austria GmbHCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Users’ profilesmoreUses other forms of storage.View details | Privacy policy\n\nCint ABCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nMonet Engine IncCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nGoogle Advertising ProductsCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nGfK GmbHCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nRevJetCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nProtected Media LTDDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction datamoreView details | Privacy policy\n\nClinch Labs LTDCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nOracle Data Cloud - MoatDoesn't use cookies.Data collected and processed: IP addresses, Non-precise location datamoreView details | Privacy policy\n\nAdtarget Teknoloji A.S.Cookie duration: 93 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nHearts and Science München GmbHCookie duration: 60 (days).Data collected and processed: IP addressesmoreCookie duration resets each session. View details | Privacy policy\n\nAmazon AdvertisingCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMoloco, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location datamoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nNoBid, Inc.Cookie duration: 7 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdtriba GmbHCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nEnsightenCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSPORTORITY UK LTDCookie duration: 1 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\neBay IncCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Privacy choicesmoreView details | Storage details | Privacy policy\n\nMetrixLab Nederland B.V.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided datamoreUses other forms of storage.View details | Privacy policy\n\nHurra Communications GmbHCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\n152 Media LLCCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nBidmatic IncCookie duration: 93 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAd partners\n\nAkamaiPrivacy policy\n\nMetaPrivacy policy\n\nAunicaPrivacy policy\n\nBooking.comPrivacy policy\n\nC3 MetricsPrivacy policy\n\nIBMPrivacy policy\n\nEvidonPrivacy policy\n\nAdacadoPrivacy policy\n\nintelliAdPrivacy policy\n\nDstilleryPrivacy policy\n\nMediaMathPrivacy policy\n\nZMSPrivacy policy\n\nOmnicom Media GroupPrivacy policy\n\nResonatePrivacy policy\n\nSmartPrivacy policy\n\nSojernPrivacy policy\n\nTradedoubler ABPrivacy policy\n\nTrustArcPrivacy policy\n\nTruEffectPrivacy policy\n\nTravel Data CollectivePrivacy policy\n\nadvolution.controlPrivacy policy\n\nLifeStreetPrivacy policy\n\nBatch MediaPrivacy policy\n\nVodafone GmbHPrivacy policy\n\nMagnitePrivacy policy\n\nScenestealerPrivacy policy\n\nNetquestPrivacy policy\n\nManage.comPrivacy policy\n\nCloudflarePrivacy policy\n\nSalesforce DMPPrivacy policy\n\nOrange AdvertisingPrivacy policy\n\nNetflixPrivacy policy\n\nebuildersPrivacy policy\n\nAppLovin Corp.Privacy policy\n\nFractional MediaPrivacy policy\n\nRackspacePrivacy policy\n\nMSI-ACIPrivacy policy\n\nAdmetricsPrivacy policy\n\nNaveggPrivacy policy\n\nAdmedoPrivacy policy\n\nKochavaPrivacy policy\n\nMobitransPrivacy policy\n\nADEXPrivacy policy\n\nImpactPrivacy policy\n\nSpotadPrivacy policy\n\nAarkiPrivacy policy\n\nSFRPrivacy policy\n\nCablatoPrivacy policy\n\nWaystackPrivacy policy\n\nTreSensaPrivacy policy\n\nAdludioPrivacy policy\n\ngskinnerPrivacy policy\n\nCUBEDPrivacy policy\n\nOptomatonPrivacy policy\n\nDentsu Aegis NetworkPrivacy policy\n\nDigisegPrivacy policy\n\nHaensel AMSPrivacy policy\n\nBDSK Handels GmbH & Co. KGPrivacy policy\n\nObjective PartnersPrivacy policy\n\nMarketing Science Consulting Group, Inc.Privacy policy\n\nDENTSUPrivacy policy\n\nKoblerPrivacy policy\n\nWidespacePrivacy policy\n\nVimeoPrivacy policy\n\nOracle Data CloudPrivacy policy",
            "url": "https://ukranews.com/ua/news/1059105-ukrayinu-nakryye-termichna-anomaliya-i-vdaryat-morozy-synoptyk-poperedyla-pro-nazvychnu-pogodu-i",
            "image": "https://ukranews.com/upload/media/2024/02/06/65c22384220a4-screenshot_9_1200x1200.jpg.webp",
            "video": null,
            "publish_date": "2025-01-16 09:26:13",
            "author": "Комендантова Надія",
            "authors": [
                "Комендантова Надія"
            ],
            "language": "en",
            "source_country": "ua",
            "sentiment": 0.239
        },
        {
            "id": 282534526,
            "title": "Трамп скасував охорону свого екс-радника з нацбезпеки Болтона",
            "text": "Президент США Дональд Трамп протягом декількох годин після вступу на посаду припинив роботу служби безпеки, яка була призначена його колишньому раднику з національної безпеки Джону Болтону, повідомляє CNN.\n\n«Я розчарований, але не здивований тим, що президент Трамп ухвалив це рішення. Незважаючи на мою критику політики президента Байдена в галузі національної безпеки, він, тим не менш, ухвалив рішення знову надати мені захист Секретної служби 2021 року», - цитує CNN слова Болтона.\n\nВидання нагадує, що Болтон, покинувши Білий дім у листопаді 2019 року, потребував постійного захисту Секретної служби США через погрози на його адресу з боку Ірану. Трамп спочатку припинив його захист після того, як покинув свою адміністрацію в першому терміні, але президент Джозеф Байден відновив його після вступу на посаду.\n\n«У 2022 році Міністерство юстиції порушило кримінальну справу проти співробітника Корпусу вартових ісламської революції Ірану за спробу найняти кілера, щоб убити мене. Ця загроза зберігається і сьогодні, що також продемонстрував нещодавній арешт людини, яка намагалася організувати вбивство самого президента Трампа. Американський народ може сам судити, яке президент ухвалив правильне рішення», - сказав Болтон.\n\nБолтон обіймав керівні посади з національної безпеки в адміністрації (колишнього президента США Джорджа - ІФ-У) Буша, відомий своєю позицією щодо Ірану. Він виступав проти ядерної угоди 2015 року, яка наклала «значні обмеження на ядерну програму Ірану в обмін на послаблення американських санкцій», і закликав Трампа вийти з угоди після вступу на посаду, пише CNN.",
            "url": "https://interfax.com.ua/news/general/1042399.html",
            "image": "https://media.interfax.com.ua/media/thumbs/images/2025/01/zngoj/6RP0EJ-5067K.jpg",
            "video": null,
            "publish_date": "2025-01-16 09:15:12",
            "author": "Interfax-Ukraine",
            "authors": [
                "Interfax-Ukraine"
            ],
            "language": "en",
            "source_country": "ua",
            "sentiment": 1.0
        },
        {
            "id": 281038582,
            "title": "Крок у століття: візит Стармера заклав підґрунтя фундаментально нового етапу українсько-британських відносин",
            "text": "TCF vendors\n\nExponential Interactive, Inc d/b/a VDX.tvCookie duration: 90 (days).Data collected and processed: IP addresses, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nRoq.ad GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdMaxim LimitedCookie duration: 30 (days).Data collected and processed: IP addresses, Probabilistic identifiers, Browsing and interaction datamoreCookie duration resets each session. View details | Privacy policy\n\nIndex Exchange Inc. Cookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nQuantcastCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nBeeswaxIO CorporationCookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSovrn, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAdikteevDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Non-precise location data, Users’ profilesmoreUses other forms of storage.View details | Privacy policy\n\nRTB House S.A.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nThe UK Trade Desk LtdCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNexxen Inc.Cookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEpsilonCookie duration: 184 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nYahoo EMEA LimitedCookie duration: 397 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nADventori SASCookie duration: 90 (days).Data collected and processed: IP addresses, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTriple Lift, Inc.Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nXandr, Inc.Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNEORY GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nNexxen Group LLCCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nNEURAL.ONECookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nADITION (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nActive Agent (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTaboola Europe LimitedCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEquativCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nAdform A/SCookie duration: 3650 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMagnite, Inc. Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRATEGAIN ADARA INCCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\n33AcrossCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSift Media, IncDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location datamoreView details | Privacy policy\n\nRakuten Marketing LLCCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLumen Research LimitedDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Privacy policy\n\nAmazon Ad ServerCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nOpenXCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nYieldlab (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRoku Advertising ServicesCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNano Interactive Group Ltd.Doesn't use cookies.Data collected and processed: Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Privacy policy\n\nSimplifi Holdings LLCCookie duration: 366 (days).Data collected and processed: IP addresses, Device identifiers, Precise location datamoreUses other forms of storage.View details | Privacy policy\n\nPubMatic, IncCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nComscore B.V.Cookie duration: 720 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nFlashtalkingCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreView details | Privacy policy\n\nPulsePoint, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nSmaato, Inc.Cookie duration: 21 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSemasio GmbHCookie duration: 366 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nCrimtan Holdings LimitedCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nGenius Sports UK LimitedCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nCriteo SACookie duration: 390 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nAdloox SADoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location datamoreUses other forms of storage.View details | Privacy policy\n\nBlis Global LimitedCookie duration: 400 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nLotame Solutions, IncCookie duration: 274 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLiveRampCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nGroupM UK LimitedCookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSonobi, IncCookie duration: 60 (days).Data collected and processed: IP addresses, Device identifiers, Non-precise location datamoreView details | Privacy policy\n\nRich Audience Technologies SLUCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nLoopMe LimitedCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDynata LLCCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAsk LocalaDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nAziraDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nDoubleVerify Inc.​Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreView details | Privacy policy\n\nBIDSWITCH GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nIPONWEB GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNextRoll, Inc.Cookie duration: 183 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nID5 Technology LtdCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTeads France SASCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nStröer SSP GmbH (SSP)Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nOS Data Solutions GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nConnectAd Demand GmbHCookie duration: 31 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nPermodo GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nPlatform161 B.V.Cookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMedia.net Advertising FZ-LLCCookie duration: 2190 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLiveIntent Inc.Cookie duration: 731 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nBasis Global Technologies, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nSeedtag Advertising S.LCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSMADEX, S.L.U.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nBombora Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profilesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nOutbrain UK LtdCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEASYmedia GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nRemerge GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location datamoreUses other forms of storage.View details | Privacy policy\n\nadvanced store GmbHCookie duration: 365 (days).Data collected and processed: Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMagnite CTV, Inc.Cookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDelta Projects ABCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\nZemanta Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nusemax advertisement (Emego GmbH)Cookie duration: 365 (days).Data collected and processed: IP addresses, Users’ profilesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nemetriq GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPublicis Media GmbHCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nM.D. Primis Technologies Ltd.Cookie duration: 25 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreView details | Storage details | Privacy policy\n\nOneTag LimitedCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nCloud Technologies S.A.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nSmartology LimitedDoesn't use cookies.Data collected and processed: IP addressesmoreUses other forms of storage.View details | Privacy policy\n\nImprove DigitalCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdobe Advertising CloudCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Authentication-derived identifiers, Privacy choicesmoreView details | Storage details | Privacy policy\n\nBannerflow ABCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nTabMo SASDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nIntegral Ad Science (incorporating ADmantX)Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location data, Privacy choicesmoreView details | Privacy policy\n\nWizalyCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nWeboramaCookie duration: 393 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nJivox CorporationCookie duration: 30 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nVistar Media EMEA BVDoesn't use cookies.Data collected and processed: Non-precise location datamoreView details | Privacy policy\n\nOn Device Research LimitedCookie duration: 30 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location datamoreView details | Storage details | Privacy policy\n\nRockabox Media LtdDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Storage details | Privacy policy\n\nExactag GmbHCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nCeltra Inc.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Precise location datamoreUses other forms of storage.View details | Storage details | Privacy policy\n\nmainADV SrlCookie duration: 30 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nGemius SACookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nThe Kantar Group LimitedCookie duration: 914 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nMGID Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNielsen Media Research Ltd.Cookie duration: 120 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nVidoomy Media SLCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Non-precise location datamoreView details | Storage details | Privacy policy\n\nSolocal SACookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPixalate, Inc.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location datamoreView details | Storage details | Privacy policy\n\nNumberlyCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAudienceProject A/SCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDemandbase, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEffiliation / EffinityCookie duration: 30 (days).Data collected and processed: Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nArrivalist Co.Cookie duration: 365 (days).Data collected and processed: IP addresses, Non-precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdtelligent Inc.Cookie duration: 93 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nSeenthis ABDoesn't use cookies.Data collected and processed: IP addresses, Device characteristicsmoreView details | Privacy policy\n\nCommanders ActCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiersmoreView details | Storage details | Privacy policy\n\ntravel audience GmbHCookie duration: 397 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profilesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nHUMANDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location datamoreView details | Privacy policy\n\nBlendee srlCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nInnovid LLCCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nPapirfly ASDoesn't use cookies.Data collected and processed: Device characteristicsmoreView details | Privacy policy\n\nNeustar, Inc., a TransUnion companyCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAdmixer EU GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nVerve Group Europe GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOtto (GmbH & Co KG)Cookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nAdobe Audience Manager, Adobe Experience PlatformCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nLocalsensor B.V.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOnline SolutionCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nOnfocus (Adagio)Cookie duration: 60 (days).Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRelay42 Netherlands B.V.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreView details | Privacy policy\n\nGP One GmbHCookie duration: Uses session cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nLiftoff Monetize and Vungle ExchangeDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nThe MediaGrid Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nReppublika Research & Analytics Austria GmbHCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Users’ profilesmoreUses other forms of storage.View details | Privacy policy\n\nCint ABCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nMonet Engine IncCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nGoogle Advertising ProductsCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nGfK GmbHCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nRevJetCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nProtected Media LTDDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction datamoreView details | Privacy policy\n\nClinch Labs LTDCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nOracle Data Cloud - MoatDoesn't use cookies.Data collected and processed: IP addresses, Non-precise location datamoreView details | Privacy policy\n\nAdtarget Teknoloji A.S.Cookie duration: 93 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nHearts and Science München GmbHCookie duration: 60 (days).Data collected and processed: IP addressesmoreCookie duration resets each session. View details | Privacy policy\n\nAmazon AdvertisingCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMoloco, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location datamoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nNoBid, Inc.Cookie duration: 7 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdtriba GmbHCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nEnsightenCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSPORTORITY UK LTDCookie duration: 1 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\neBay IncCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Privacy choicesmoreView details | Storage details | Privacy policy\n\nMetrixLab Nederland B.V.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided datamoreUses other forms of storage.View details | Privacy policy\n\nHurra Communications GmbHCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\n152 Media LLCCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nBidmatic IncCookie duration: 93 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAd partners\n\nAkamaiPrivacy policy\n\nMetaPrivacy policy\n\nAunicaPrivacy policy\n\nBooking.comPrivacy policy\n\nC3 MetricsPrivacy policy\n\nIBMPrivacy policy\n\nEvidonPrivacy policy\n\nAdacadoPrivacy policy\n\nintelliAdPrivacy policy\n\nDstilleryPrivacy policy\n\nMediaMathPrivacy policy\n\nZMSPrivacy policy\n\nOmnicom Media GroupPrivacy policy\n\nResonatePrivacy policy\n\nSmartPrivacy policy\n\nSojernPrivacy policy\n\nTradedoubler ABPrivacy policy\n\nTrustArcPrivacy policy\n\nTruEffectPrivacy policy\n\nTravel Data CollectivePrivacy policy\n\nadvolution.controlPrivacy policy\n\nLifeStreetPrivacy policy\n\nBatch MediaPrivacy policy\n\nVodafone GmbHPrivacy policy\n\nMagnitePrivacy policy\n\nScenestealerPrivacy policy\n\nNetquestPrivacy policy\n\nManage.comPrivacy policy\n\nCloudflarePrivacy policy\n\nSalesforce DMPPrivacy policy\n\nOrange AdvertisingPrivacy policy\n\nNetflixPrivacy policy\n\nebuildersPrivacy policy\n\nAppLovin Corp.Privacy policy\n\nFractional MediaPrivacy policy\n\nRackspacePrivacy policy\n\nMSI-ACIPrivacy policy\n\nAdmetricsPrivacy policy\n\nNaveggPrivacy policy\n\nAdmedoPrivacy policy\n\nKochavaPrivacy policy\n\nMobitransPrivacy policy\n\nADEXPrivacy policy\n\nImpactPrivacy policy\n\nSpotadPrivacy policy\n\nAarkiPrivacy policy\n\nSFRPrivacy policy\n\nCablatoPrivacy policy\n\nWaystackPrivacy policy\n\nTreSensaPrivacy policy\n\nAdludioPrivacy policy\n\ngskinnerPrivacy policy\n\nCUBEDPrivacy policy\n\nOptomatonPrivacy policy\n\nDentsu Aegis NetworkPrivacy policy\n\nDigisegPrivacy policy\n\nHaensel AMSPrivacy policy\n\nBDSK Handels GmbH & Co. KGPrivacy policy\n\nObjective PartnersPrivacy policy\n\nMarketing Science Consulting Group, Inc.Privacy policy\n\nDENTSUPrivacy policy\n\nKoblerPrivacy policy\n\nWidespacePrivacy policy\n\nVimeoPrivacy policy\n\nOracle Data CloudPrivacy policy",
            "url": "https://ukranews.com/ua/publication/4111-krok-u-stolittya-vizyt-starmera-zaklav-pidgruntya-fundamentalno-novogo-etapu-ukrayinsko-brytanskyh",
            "image": "https://ukranews.com/upload/media/2025/01/17/678a01be388ec-Ze_1200x1200.jpg.webp",
            "video": null,
            "publish_date": "2025-01-16 09:26:13",
            "author": "Гліб Остапенко",
            "authors": [
                "Гліб Остапенко"
            ],
            "language": "en",
            "source_country": "ua",
            "sentiment": 0.239
        },
        {
            "id": 279765670,
            "title": "President Zelensky’s ‘Ramstein’ Address to Ukraine’s Allies",
            "text": "From the Editors: President Zelensky delivered a speech at a meeting of Ukraine’s supporters on Jan. 9 at the US air base Ramstein in Germany, the last such gathering of allies in this format before Donald Trump takes office in Washington on Jan. 20. The Ukrainian leader later announced that Ukraine’s Western allies had pledged an additional $2 billion in military assistance.\n\nLadies and gentlemen! Dear friends!\n\nIt’s clear that a new chapter starts for Europe and the entire world – just 11 days from now, a time when we have to cooperate even more, rely on one another even more, and achieve even greater results together. And I see this as a time of opportunities.\n\nAnd in almost three years of full-scale war, we’ve shown that when we come and belong together – no one is too small to make a real impact on history. And we’ve come such a long way that it would honestly be crazy to drop the ball now and not keep building on the defense coalitions we’ve created – especially since they’re already helping us grow and strengthen what’s basically our shared defense power. No matter what’s going on in the world, everyone wants to feel sure that their country will not just be erased off the map. That used to depend on a handful of big capitals, but now it’s on all of us – on how we work together, how ready we are to own our future, and how well we can convince our partners to stand with us. The more determination we show in defending our interests – the more interest our partners, and especially the U.S., will see it’s good to stay on our side.\n\nYesterday I held a special meeting with the Supreme Commander-in-Chief’s Staff. And the focus was on the production and supply of drones for our soldiers, for our army and electronic warfare.\n\nDrones are something that has already changed the nature of war, and the changes are far from over. Today, there is a direct dependence – to stop the advance of the enemy, to stop losing people and territories we need drones. Drones deter the enemy – keep them at the distance. It can be done.\n\nProduction of drones in Ukraine is more cost-effective than anywhere else. This year, we in Ukraine want to set a record for the number and quality of drones we produce and get from our partners. And we’re focusing on drones that our brigades need to hold the front lines, and drones essential for ensuring security like maritime drones, and drones made for deep strikes on the enemy’s military facilities and infrastructure in their territory. We’ve already signed a significant number of contracts, with many more still in the works. I urge all of you to get even more actively involved in building up this arsenal of drones. Ukrainians have the most experience in Europe with using drones, and we also have the biggest capacity in Europe to produce drones.\n\nSo, first, please invest more in this Ukrainian strength, because after the war it will also be your strength. Second, invest in the talented people in your countries who can help make all of us stronger in the drone field.\n\nWith most of the countries represented here, we already have bilateral security cooperation. I’m grateful to those countries with which we’ve signed bilateral security agreements – 27 of them as of today. And fully implementing these agreements is a real contribution not only to our security in Ukraine but also to your security.\n\nBut we are a bigger number here in Ramstein. Much bigger. Let’s pull our strength together and make such agreements with all the participants. And I’m asking my Minister of Defense to work with the Secretary and with all the ministers to increase the number of these documents, of course, if partners will support this idea. And I know that it will strengthen our frontline, and it will protect, which is very, very important especially in winter, it will protect our energy sector too – not only in Ukraine but also in your lands. It will boost the security programs.\n\nAnd now we see all the reports with underwater cables in the Baltic Sea. And we all see drone incidents in some countries that are raising serious concerns. We see destabilization in Africa, which threatens Europe with new migration waves. And we’re also learning more about how Russian intelligence paid militants in Afghanistan to target coalition soldiers when your troops were present there – Moscow cashed in to kill your soldiers – American soldiers, NATO countries soldiers. How can this be forgiven or forgotten?\n\nRussia’s hybrid aggression and sabotage against the entire Western world is ongoing, and only by keeping and strengthening our cooperation, by boosting our agreements and coalitions can we truly protect the normal lives of people in all our countries.\n\nI do everything I can to end this war with dignity for Ukraine and all of Europe this year. And I know I can count on your support. And we all must remember that ending the war is our shared goal – our, not Russia’s, it’s what Ukrainians, Europeans, Americans, and many of our global partners want. Countries as far apart as Japan, Saudi Arabia, and Argentina also wish us peace. But here is the thing – Putin is not just holding on to his investments in aggression, he’s doubling down. He’s even started, basically, hiring soldiers from North Korea to keep this war going. North Korea studies modern warfare. They do not value their people, and we know it, they lose them – 4,000 as for today. But Pyongyang gets experience cheap to re-export the war, maybe there in the Indo-Pacific.\n\nAt the same time, this collusion with North Korea shows Putin’s weakness – because no ruler in Moscow would ever lower themselves to beg in Pyongyang unless facing critical problems. So, we’ve got to keep the pressure on Russia. That’s what ensures our soldiers get the weapons they need. That’s what sanctions are for. And I’m asking all our partners – especially the U.S. and the EU – to turn up the heat on Russia’s energy sector. Sanctions are needed against every element of Russian energy, and the Russian tanker fleet must be stopped. Russia’s war budget for 2025 is 25% bigger than last year’s. If we want to stop the killing, we’ve got to cut off Putin’s cash flow. Putin will start thinking about peace only when his inner circle tells him he’s out of money.\n\nAnd one more thing. The key to resisting aggression is motivation. And we know it. Motivation to risk your life to save your country. But motivation needs fuel, and the best fuel is success – I mean successful actions, successful agreements. When our troops can shoot down Russian missiles, including ballistic ones, and keep Russian aircraft away from Ukraine, it provides the motivation we desperately need. And we’ve had talks with the U.S. about licensing the production of air defense systems and missiles here in Ukraine, and this could become a significant part of our security guarantees – and it’s absolutely doable.\n\nBut we must keep in mind that the last NATO Summit promises haven’t been fulfilled yet – we need, very much, we need the air defense systems you gave us already, thank you so much, and we need very much the systems you promised us. You’ve seen what happened yesterday in our city of Zaporizhzhia – Russia’s bombs killed 13 people, 112 were injured. That was just one day, just one attack, one strike from the air. We must stop Russia’s terror. And you can do it. And we ask for urgent deliveries of air defense systems.\n\nWe also need to deliver on all our agreements for frontline supplies. And I want to thank again every country for helping us with artillery, armored vehicles, and everything else we need. Our men and women on the frontlines need to feel that the world has their back, and nothing proves that better than making sure they have what they need to hit back at Russian attacks.\n\nLast year France came up with the idea to deploy partners’ contingents in Ukraine, and you know it – to make peace closer. And we all understand – as for today, Putin’s aims remain unchanged. And he wants to totally destroy Ukraine – and to break all of us and you too. That’s why our goal is to find as many instruments as possible to force Russia into peace. I believe that such deployment of partners’ contingents is one of the best instruments. Let’s be more practical in making it possible. And we’ve heard signals also from some of our partners, from the United Kingdom – in support of this.\n\nAnd we must be brave, and we must propose truly strong instruments. Take, for example, the Kursk operation – it’s one of our wins, I think one of the biggest wins, not just last year, but throughout the war. Russia had to pull almost 60,000 troops off the Ukrainian front to deal with it. And as of this Monday, it’s been five months since our troops have maintained a buffer zone on Russian territory. Many of Russia’s threats and bold claims turned out to be bluffing – especially after Ukrainians moved into the Kursk region. And I’m sure even more of their threats will prove to be bluffs if we all work even harder together to push Russia toward peace.\n\nThank you for your attention. Thank you, Secretary! Stay confident.\n\nСлава Україні!\n\nSee the original on the presidential website here.",
            "summary": "“When We Come and Belong Together – No One Is Too Small to Make a Real Impact on History.”",
            "url": "https://www.kyivpost.com/post/45231",
            "image": "https://static.kyivpost.com/storage/2025/01/10/ec8e4ed47f3f9d8b122e8397380f38fc.jpeg?w=1200&q=90&f=jpg",
            "video": null,
            "publish_date": "2025-01-10 12:17:48",
            "author": "Kyiv Post",
            "authors": [
                "Kyiv Post"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "ua",
            "sentiment": 0.28
        },
        {
            "id": 281677178,
            "title": "На Рівненщині згоріла дерев'яна церква 1877 року",
            "text": "TCF vendors\n\nExponential Interactive, Inc d/b/a VDX.tvCookie duration: 90 (days).Data collected and processed: IP addresses, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nRoq.ad GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdMaxim LimitedCookie duration: 30 (days).Data collected and processed: IP addresses, Probabilistic identifiers, Browsing and interaction datamoreCookie duration resets each session. View details | Privacy policy\n\nIndex Exchange Inc. Cookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nQuantcastCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nBeeswaxIO CorporationCookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSovrn, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAdikteevDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Non-precise location data, Users’ profilesmoreUses other forms of storage.View details | Privacy policy\n\nRTB House S.A.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nThe UK Trade Desk LtdCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNexxen Inc.Cookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEpsilonCookie duration: 184 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nYahoo EMEA LimitedCookie duration: 397 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nADventori SASCookie duration: 90 (days).Data collected and processed: IP addresses, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTriple Lift, Inc.Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nXandr, Inc.Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNEORY GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nNexxen Group LLCCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nNEURAL.ONECookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nADITION (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nActive Agent (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTaboola Europe LimitedCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEquativCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nAdform A/SCookie duration: 3650 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMagnite, Inc. Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRATEGAIN ADARA INCCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\n33AcrossCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSift Media, IncDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location datamoreView details | Privacy policy\n\nRakuten Marketing LLCCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLumen Research LimitedDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Privacy policy\n\nAmazon Ad ServerCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nOpenXCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nYieldlab (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRoku Advertising ServicesCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNano Interactive Group Ltd.Doesn't use cookies.Data collected and processed: Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Privacy policy\n\nSimplifi Holdings LLCCookie duration: 366 (days).Data collected and processed: IP addresses, Device identifiers, Precise location datamoreUses other forms of storage.View details | Privacy policy\n\nPubMatic, IncCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nComscore B.V.Cookie duration: 720 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nFlashtalkingCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreView details | Privacy policy\n\nPulsePoint, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nSmaato, Inc.Cookie duration: 21 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSemasio GmbHCookie duration: 366 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nCrimtan Holdings LimitedCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nGenius Sports UK LimitedCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nCriteo SACookie duration: 390 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nAdloox SADoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location datamoreUses other forms of storage.View details | Privacy policy\n\nBlis Global LimitedCookie duration: 400 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nLotame Solutions, IncCookie duration: 274 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLiveRampCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nGroupM UK LimitedCookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSonobi, IncCookie duration: 60 (days).Data collected and processed: IP addresses, Device identifiers, Non-precise location datamoreView details | Storage details | Privacy policy\n\nRich Audience Technologies SLUCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nLoopMe LimitedCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDynata LLCCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAsk LocalaDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nAziraDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nDoubleVerify Inc.​Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreView details | Privacy policy\n\nBIDSWITCH GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nIPONWEB GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNextRoll, Inc.Cookie duration: 183 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nID5 Technology LtdCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTeads France SASCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nStröer SSP GmbH (SSP)Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nOS Data Solutions GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nConnectAd Demand GmbHCookie duration: 31 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nPermodo GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nPlatform161 B.V.Cookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMedia.net Advertising FZ-LLCCookie duration: 2190 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLiveIntent Inc.Cookie duration: 731 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nBasis Global Technologies, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nSeedtag Advertising S.LCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSMADEX, S.L.U.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nBombora Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profilesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nOutbrain UK LtdCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEASYmedia GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nRemerge GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location datamoreUses other forms of storage.View details | Privacy policy\n\nadvanced store GmbHCookie duration: 365 (days).Data collected and processed: Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMagnite CTV, Inc.Cookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDelta Projects ABCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\nZemanta Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nusemax advertisement (Emego GmbH)Cookie duration: 365 (days).Data collected and processed: IP addresses, Users’ profilesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nemetriq GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPublicis Media GmbHCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nM.D. Primis Technologies Ltd.Cookie duration: 25 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreView details | Storage details | Privacy policy\n\nOneTag LimitedCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nCloud Technologies S.A.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nSmartology LimitedDoesn't use cookies.Data collected and processed: IP addressesmoreUses other forms of storage.View details | Privacy policy\n\nImprove DigitalCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdobe Advertising CloudCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Authentication-derived identifiers, Privacy choicesmoreView details | Storage details | Privacy policy\n\nBannerflow ABCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nTabMo SASDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nIntegral Ad Science (incorporating ADmantX)Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location data, Privacy choicesmoreView details | Privacy policy\n\nWizalyCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nWeboramaCookie duration: 393 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nJivox CorporationCookie duration: 30 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nVistar Media EMEA BVDoesn't use cookies.Data collected and processed: Non-precise location datamoreView details | Privacy policy\n\nOn Device Research LimitedCookie duration: 30 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location datamoreView details | Storage details | Privacy policy\n\nRockabox Media LtdDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Storage details | Privacy policy\n\nExactag GmbHCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nCeltra Inc.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Precise location datamoreUses other forms of storage.View details | Storage details | Privacy policy\n\nmainADV SrlCookie duration: 30 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nGemius SACookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nThe Kantar Group LimitedCookie duration: 914 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nMGID Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNielsen Media Research Ltd.Cookie duration: 120 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nVidoomy Media SLCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Non-precise location datamoreView details | Storage details | Privacy policy\n\nSolocal SACookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPixalate, Inc.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location datamoreView details | Storage details | Privacy policy\n\nNumberlyCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAudienceProject A/SCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDemandbase, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEffiliation / EffinityCookie duration: 30 (days).Data collected and processed: Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nArrivalist Co.Cookie duration: 365 (days).Data collected and processed: IP addresses, Non-precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdtelligent Inc.Cookie duration: 93 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nSeenthis ABDoesn't use cookies.Data collected and processed: IP addresses, Device characteristicsmoreView details | Privacy policy\n\nCommanders ActCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiersmoreView details | Storage details | Privacy policy\n\ntravel audience GmbHCookie duration: 397 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profilesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nHUMANDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location datamoreView details | Privacy policy\n\nBlendee srlCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nInnovid LLCCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nPapirfly ASDoesn't use cookies.Data collected and processed: Device characteristicsmoreView details | Privacy policy\n\nNeustar, Inc., a TransUnion companyCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAdmixer EU GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nVerve Group Europe GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOtto (GmbH & Co KG)Cookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nAdobe Audience Manager, Adobe Experience PlatformCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nLocalsensor B.V.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOnline SolutionCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nOnfocus (Adagio)Cookie duration: 60 (days).Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRelay42 Netherlands B.V.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreView details | Privacy policy\n\nGP One GmbHCookie duration: Uses session cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nLiftoff Monetize and Vungle ExchangeDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nThe MediaGrid Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nReppublika Research & Analytics Austria GmbHCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Users’ profilesmoreUses other forms of storage.View details | Privacy policy\n\nCint ABCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nMonet Engine IncCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nGoogle Advertising ProductsCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nGfK GmbHCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nRevJetCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nProtected Media LTDDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction datamoreView details | Privacy policy\n\nClinch Labs LTDCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nOracle Data Cloud - MoatDoesn't use cookies.Data collected and processed: IP addresses, Non-precise location datamoreView details | Privacy policy\n\nAdtarget Teknoloji A.S.Cookie duration: 93 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nHearts and Science München GmbHCookie duration: 60 (days).Data collected and processed: IP addressesmoreCookie duration resets each session. View details | Privacy policy\n\nAmazon AdvertisingCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMoloco, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location datamoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nNoBid, Inc.Cookie duration: 7 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdtriba GmbHCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nEnsightenCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSPORTORITY UK LTDCookie duration: 1 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\neBay IncCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Privacy choicesmoreView details | Storage details | Privacy policy\n\nMetrixLab Nederland B.V.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided datamoreUses other forms of storage.View details | Privacy policy\n\nHurra Communications GmbHCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\n152 Media LLCCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nBidmatic IncCookie duration: 93 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAd partners\n\nAkamaiPrivacy policy\n\nMetaPrivacy policy\n\nAunicaPrivacy policy\n\nBooking.comPrivacy policy\n\nC3 MetricsPrivacy policy\n\nIBMPrivacy policy\n\nEvidonPrivacy policy\n\nAdacadoPrivacy policy\n\nintelliAdPrivacy policy\n\nDstilleryPrivacy policy\n\nMediaMathPrivacy policy\n\nZMSPrivacy policy\n\nOmnicom Media GroupPrivacy policy\n\nResonatePrivacy policy\n\nSmartPrivacy policy\n\nSojernPrivacy policy\n\nTradedoubler ABPrivacy policy\n\nTrustArcPrivacy policy\n\nTruEffectPrivacy policy\n\nTravel Data CollectivePrivacy policy\n\nadvolution.controlPrivacy policy\n\nLifeStreetPrivacy policy\n\nBatch MediaPrivacy policy\n\nVodafone GmbHPrivacy policy\n\nMagnitePrivacy policy\n\nScenestealerPrivacy policy\n\nNetquestPrivacy policy\n\nManage.comPrivacy policy\n\nCloudflarePrivacy policy\n\nSalesforce DMPPrivacy policy\n\nOrange AdvertisingPrivacy policy\n\nNetflixPrivacy policy\n\nebuildersPrivacy policy\n\nAppLovin Corp.Privacy policy\n\nFractional MediaPrivacy policy\n\nRackspacePrivacy policy\n\nMSI-ACIPrivacy policy\n\nAdmetricsPrivacy policy\n\nNaveggPrivacy policy\n\nAdmedoPrivacy policy\n\nKochavaPrivacy policy\n\nMobitransPrivacy policy\n\nADEXPrivacy policy\n\nImpactPrivacy policy\n\nSpotadPrivacy policy\n\nAarkiPrivacy policy\n\nSFRPrivacy policy\n\nCablatoPrivacy policy\n\nWaystackPrivacy policy\n\nTreSensaPrivacy policy\n\nAdludioPrivacy policy\n\ngskinnerPrivacy policy\n\nCUBEDPrivacy policy\n\nOptomatonPrivacy policy\n\nDentsu Aegis NetworkPrivacy policy\n\nDigisegPrivacy policy\n\nHaensel AMSPrivacy policy\n\nBDSK Handels GmbH & Co. KGPrivacy policy\n\nObjective PartnersPrivacy policy\n\nMarketing Science Consulting Group, Inc.Privacy policy\n\nDENTSUPrivacy policy\n\nKoblerPrivacy policy\n\nWidespacePrivacy policy\n\nVimeoPrivacy policy\n\nOracle Data CloudPrivacy policy",
            "url": "https://ukranews.com/ua/news/1059470-na-rivnenshhyni-zgorila-derev-yana-tserkva-1877-roku",
            "image": "https://ukranews.com/upload/media/2025/01/19/678d130b41916-photo_2025-01-19_16-30-39_1200x1200.jpg.webp",
            "video": null,
            "publish_date": "2025-01-16 09:26:13",
            "author": "Драгомірова Валерія",
            "authors": [
                "Драгомірова Валерія"
            ],
            "language": "en",
            "category": "science",
            "source_country": "ua",
            "sentiment": 0.239
        },
        {
            "id": 281029610,
            "title": "У Херсонській області через російські обстріли поранено семеро людей",
            "text": "Російські війська обстрілювали Херсонську область у четвер, унаслідок чого поранено 7 осіб, повідомив голова ОВА Олександр Прокудін.\n\n\"Минулої доби під ворожим вогнем та авіаударами опинилися Антонівка, Садове, Придніпровське, Янтарне, Томина Балка, Станіслав, Софіївка, Кізомис, Олександрівка, Берислав, Новокаїри, Червоний Маяк, Шляхове, Новоолександрівка, Новоберислав, Томарине, Осокорівка, Українка, Бургунка, Суханове, Білозерка, Крупиця, Монастирське, Ольгівка, Іванівка, Федорівка, Вірівка, Миколаївка, Новотягинка, Велетенське, Зміївка, Токарівка, Львове, Козацьке, Гаврилівка, Михайлівка та місто Херсон\", - ідеться в повідомленні.\n\nПрокудін зазначив, що внаслідок російської агресії 7 осіб дістали поранення.\n\nЗа його словами, російські військові гатили по житлових кварталах населених пунктів області, зокрема пошкодили багатоповерхівку та 15 приватних будинків. Також окупанти пошкодили десяток транспортних засобів.",
            "url": "https://interfax.com.ua/news/general/1041387.html",
            "image": "https://media.interfax.com.ua/media/thumbs/images/2023/03/Ad1a5wIe_Kns.jpg",
            "video": null,
            "publish_date": "2025-01-16 09:15:12",
            "author": "Interfax-Ukraine",
            "authors": [
                "Interfax-Ukraine"
            ],
            "language": "en",
            "source_country": "ua",
            "sentiment": 0.0
        },
        {
            "id": 281039776,
            "title": "Армія РФ окупувала ще три населених пункти на Донеччині, – DeepState",
            "text": "TCF vendors\n\nExponential Interactive, Inc d/b/a VDX.tvCookie duration: 90 (days).Data collected and processed: IP addresses, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nRoq.ad GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdMaxim LimitedCookie duration: 30 (days).Data collected and processed: IP addresses, Probabilistic identifiers, Browsing and interaction datamoreCookie duration resets each session. View details | Privacy policy\n\nIndex Exchange Inc. Cookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nQuantcastCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nBeeswaxIO CorporationCookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSovrn, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAdikteevDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Non-precise location data, Users’ profilesmoreUses other forms of storage.View details | Privacy policy\n\nRTB House S.A.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nThe UK Trade Desk LtdCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNexxen Inc.Cookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEpsilonCookie duration: 184 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nYahoo EMEA LimitedCookie duration: 397 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nADventori SASCookie duration: 90 (days).Data collected and processed: IP addresses, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTriple Lift, Inc.Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nXandr, Inc.Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNEORY GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nNexxen Group LLCCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nNEURAL.ONECookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nADITION (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nActive Agent (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTaboola Europe LimitedCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEquativCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nAdform A/SCookie duration: 3650 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nMagnite, Inc. Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRATEGAIN ADARA INCCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\n33AcrossCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSift Media, IncDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location datamoreView details | Privacy policy\n\nRakuten Marketing LLCCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLumen Research LimitedDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Privacy policy\n\nAmazon Ad ServerCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nOpenXCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nYieldlab (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRoku Advertising ServicesCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNano Interactive Group Ltd.Doesn't use cookies.Data collected and processed: Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Privacy policy\n\nSimplifi Holdings LLCCookie duration: 366 (days).Data collected and processed: IP addresses, Device identifiers, Precise location datamoreUses other forms of storage.View details | Privacy policy\n\nPubMatic, IncCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nComscore B.V.Cookie duration: 720 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nFlashtalkingCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreView details | Privacy policy\n\nPulsePoint, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nSmaato, Inc.Cookie duration: 21 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSemasio GmbHCookie duration: 366 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nCrimtan Holdings LimitedCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nGenius Sports UK LimitedCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nCriteo SACookie duration: 390 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nAdloox SADoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location datamoreUses other forms of storage.View details | Privacy policy\n\nBlis Global LimitedCookie duration: 400 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nLotame Solutions, IncCookie duration: 274 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLiveRampCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nGroupM UK LimitedCookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSonobi, IncCookie duration: 60 (days).Data collected and processed: IP addresses, Device identifiers, Non-precise location datamoreView details | Storage details | Privacy policy\n\nRich Audience Technologies SLUCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nLoopMe LimitedCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDynata LLCCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAsk LocalaDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nAziraDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nDoubleVerify Inc.​Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreView details | Privacy policy\n\nBIDSWITCH GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nIPONWEB GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNextRoll, Inc.Cookie duration: 183 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nID5 Technology LtdCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTeads France SASCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nStröer SSP GmbH (SSP)Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nOS Data Solutions GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nConnectAd Demand GmbHCookie duration: 31 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nPermodo GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nPlatform161 B.V.Cookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMedia.net Advertising FZ-LLCCookie duration: 2190 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLiveIntent Inc.Cookie duration: 731 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nBasis Global Technologies, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nSeedtag Advertising S.LCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSMADEX, S.L.U.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nBombora Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profilesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nOutbrain UK LtdCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEASYmedia GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nRemerge GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location datamoreUses other forms of storage.View details | Privacy policy\n\nadvanced store GmbHCookie duration: 365 (days).Data collected and processed: Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMagnite CTV, Inc.Cookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDelta Projects ABCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\nZemanta Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nusemax advertisement (Emego GmbH)Cookie duration: 365 (days).Data collected and processed: IP addresses, Users’ profilesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nemetriq GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPublicis Media GmbHCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nM.D. Primis Technologies Ltd.Cookie duration: 25 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreView details | Storage details | Privacy policy\n\nOneTag LimitedCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nCloud Technologies S.A.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nSmartology LimitedDoesn't use cookies.Data collected and processed: IP addressesmoreUses other forms of storage.View details | Privacy policy\n\nImprove DigitalCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdobe Advertising CloudCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Authentication-derived identifiers, Privacy choicesmoreView details | Storage details | Privacy policy\n\nBannerflow ABCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nTabMo SASDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nIntegral Ad Science (incorporating ADmantX)Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location data, Privacy choicesmoreView details | Privacy policy\n\nWizalyCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nWeboramaCookie duration: 393 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nJivox CorporationCookie duration: 30 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nVistar Media EMEA BVDoesn't use cookies.Data collected and processed: Non-precise location datamoreView details | Privacy policy\n\nOn Device Research LimitedCookie duration: 30 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location datamoreView details | Storage details | Privacy policy\n\nRockabox Media LtdDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Storage details | Privacy policy\n\nExactag GmbHCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nCeltra Inc.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Precise location datamoreUses other forms of storage.View details | Storage details | Privacy policy\n\nmainADV SrlCookie duration: 30 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nGemius SACookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nThe Kantar Group LimitedCookie duration: 914 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nMGID Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNielsen Media Research Ltd.Cookie duration: 120 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nVidoomy Media SLCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Non-precise location datamoreView details | Storage details | Privacy policy\n\nSolocal SACookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPixalate, Inc.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location datamoreView details | Storage details | Privacy policy\n\nNumberlyCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAudienceProject A/SCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDemandbase, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEffiliation / EffinityCookie duration: 30 (days).Data collected and processed: Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nArrivalist Co.Cookie duration: 365 (days).Data collected and processed: IP addresses, Non-precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdtelligent Inc.Cookie duration: 93 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nSeenthis ABDoesn't use cookies.Data collected and processed: IP addresses, Device characteristicsmoreView details | Privacy policy\n\nCommanders ActCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiersmoreView details | Storage details | Privacy policy\n\ntravel audience GmbHCookie duration: 397 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profilesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nHUMANDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location datamoreView details | Privacy policy\n\nBlendee srlCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nInnovid LLCCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nPapirfly ASDoesn't use cookies.Data collected and processed: Device characteristicsmoreView details | Privacy policy\n\nNeustar, Inc., a TransUnion companyCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAdmixer EU GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nVerve Group Europe GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOtto (GmbH & Co KG)Cookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nAdobe Audience Manager, Adobe Experience PlatformCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nLocalsensor B.V.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOnline SolutionCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nOnfocus (Adagio)Cookie duration: 60 (days).Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRelay42 Netherlands B.V.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreView details | Privacy policy\n\nGP One GmbHCookie duration: Uses session cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nLiftoff Monetize and Vungle ExchangeDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nThe MediaGrid Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nReppublika Research & Analytics Austria GmbHCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Users’ profilesmoreUses other forms of storage.View details | Privacy policy\n\nCint ABCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nMonet Engine IncCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nGoogle Advertising ProductsCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nGfK GmbHCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nRevJetCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nProtected Media LTDDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction datamoreView details | Privacy policy\n\nClinch Labs LTDCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nOracle Data Cloud - MoatDoesn't use cookies.Data collected and processed: IP addresses, Non-precise location datamoreView details | Privacy policy\n\nAdtarget Teknoloji A.S.Cookie duration: 93 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nHearts and Science München GmbHCookie duration: 60 (days).Data collected and processed: IP addressesmoreCookie duration resets each session. View details | Privacy policy\n\nAmazon AdvertisingCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMoloco, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location datamoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nNoBid, Inc.Cookie duration: 7 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdtriba GmbHCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nEnsightenCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSPORTORITY UK LTDCookie duration: 1 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\neBay IncCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Privacy choicesmoreView details | Storage details | Privacy policy\n\nMetrixLab Nederland B.V.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided datamoreUses other forms of storage.View details | Privacy policy\n\nHurra Communications GmbHCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\n152 Media LLCCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nBidmatic IncCookie duration: 93 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAd partners\n\nAkamaiPrivacy policy\n\nMetaPrivacy policy\n\nAunicaPrivacy policy\n\nBooking.comPrivacy policy\n\nC3 MetricsPrivacy policy\n\nIBMPrivacy policy\n\nEvidonPrivacy policy\n\nAdacadoPrivacy policy\n\nintelliAdPrivacy policy\n\nDstilleryPrivacy policy\n\nMediaMathPrivacy policy\n\nZMSPrivacy policy\n\nOmnicom Media GroupPrivacy policy\n\nResonatePrivacy policy\n\nSmartPrivacy policy\n\nSojernPrivacy policy\n\nTradedoubler ABPrivacy policy\n\nTrustArcPrivacy policy\n\nTruEffectPrivacy policy\n\nTravel Data CollectivePrivacy policy\n\nadvolution.controlPrivacy policy\n\nLifeStreetPrivacy policy\n\nBatch MediaPrivacy policy\n\nVodafone GmbHPrivacy policy\n\nMagnitePrivacy policy\n\nScenestealerPrivacy policy\n\nNetquestPrivacy policy\n\nManage.comPrivacy policy\n\nCloudflarePrivacy policy\n\nSalesforce DMPPrivacy policy\n\nOrange AdvertisingPrivacy policy\n\nNetflixPrivacy policy\n\nebuildersPrivacy policy\n\nAppLovin Corp.Privacy policy\n\nFractional MediaPrivacy policy\n\nRackspacePrivacy policy\n\nMSI-ACIPrivacy policy\n\nAdmetricsPrivacy policy\n\nNaveggPrivacy policy\n\nAdmedoPrivacy policy\n\nKochavaPrivacy policy\n\nMobitransPrivacy policy\n\nADEXPrivacy policy\n\nImpactPrivacy policy\n\nSpotadPrivacy policy\n\nAarkiPrivacy policy\n\nSFRPrivacy policy\n\nCablatoPrivacy policy\n\nWaystackPrivacy policy\n\nTreSensaPrivacy policy\n\nAdludioPrivacy policy\n\ngskinnerPrivacy policy\n\nCUBEDPrivacy policy\n\nOptomatonPrivacy policy\n\nDentsu Aegis NetworkPrivacy policy\n\nDigisegPrivacy policy\n\nHaensel AMSPrivacy policy\n\nBDSK Handels GmbH & Co. KGPrivacy policy\n\nObjective PartnersPrivacy policy\n\nMarketing Science Consulting Group, Inc.Privacy policy\n\nDENTSUPrivacy policy\n\nKoblerPrivacy policy\n\nWidespacePrivacy policy\n\nVimeoPrivacy policy\n\nOracle Data CloudPrivacy policy",
            "url": "https://ukranews.com/ua/news/1059108-armiya-rf-okupuvala-shhe-try-naselenyh-punkty-na-donechchyni-deepstate",
            "image": "https://ukranews.com/upload/media/2024/11/17/6739684590ef2-russian-occupants-1711_1200x1200.jpeg.webp",
            "video": null,
            "publish_date": "2025-01-16 09:26:13",
            "author": "Комендантова Надія",
            "authors": [
                "Комендантова Надія"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "ua",
            "sentiment": 0.239
        }
    ]
}